'use client'

import Icon from './Icon';
import DivButton from '../dashboard/DivButton';
import { useState } from 'react';

const CollapsibleText = () => {

    const [open, setOpen] = useState(false);

    return (
        <div className='flex relative flex-col bg-secondary p-5 rounded-3xl'>
            <div className={`relative rtl text-justify  ${open ? "h-fit" : "h-[500px]"} overflow-hidden`}>


                <div>
                    آموزش برنامه نویسی با راکت
                    برنامه نویسی یکی از حوزه‌های داغ در دنیای کنونی است و افراد بسیار زیادی تصمیم دارند تا فرایند آموزش برنامه نویسی را آغاز کنند. دلایل بسیار زیادی برای این موضوع وجود دارد که در ادامه به آن‌ها خواهیم پرداخت. اما این نکته را در ذهن داشته باشید که یادگیری و آموزش برنامه نویسی می‌تواند آینده شما را تضمین کرده و مسیر کاری مشخصی را برای شما ایجاد کند.

                    در این مطلب از وبسایت راکت قصد داریم در ارتباط با ضرورت آموزش برنامه نویسی صحبت کنیم، تاریخچه‌ای کلی از آن را مورد ارزیابی قراردهیم، مسیری برای آموزش برنامه نویسی از صفر را به شما معرفی کنیم و همچنین از آموزش‌های رایگان و آموزش‌های مربوط به وب بگوییم.

                    مزایا یادگیری و آموزش برنامه نویسی
                    دلایل زیادی برای یادگیری و آموزش برنامه نویسی وجود دارد. در اینجا چند مورد از مهم ترین آن‌ها آورده شده است:

                    آینده شغلی: برنامه نویسی یکی از پرتقاضاترین مهارت ها در بازار کار امروز است. طبق گزارشی از مجمع جهانی اقتصاد، مهارت های نرم افزاری و فناوری اطلاعات در صدر لیست مهارت هایی قرار دارند که بیشترین تقاضا را در آینده دارند. یادگیری برنامه نویسی می تواند به شما کمک کند تا در دنیای کار رقابتی پیشی بگیرید و شغلی با درآمد بالا و رضایت بخش پیدا کنید.

                    خلاقیت: برنامه نویسی یک فعالیت خلاقانه است. شما می توانید از آن برای ایجاد محصولات و خدمات جدید و نوآورانه استفاده کنید. یادگیری برنامه نویسی می تواند به شما کمک کند تا خلاقیت خود را بیان کنید و دنیا را به روشی جدید ببینید.

                    حل مسئله: برنامه نویسی یک مهارت حل مسئله است. شما باید بتوانید مشکلات را به قطعات کوچکتر تقسیم کنید و راه حل هایی برای آنها پیدا کنید. یادگیری برنامه نویسی می تواند به شما کمک کند تا مهارت های حل مسئله خود را بهبود ببخشید و در زندگی و کار خود موفق تر باشید.

                    تفکر منطقی: برنامه نویسی یک فعالیت منطقی است. شما باید بتوانید از منطق برای فکر کردن به مشکلات و یافتن راه حل های مناسب استفاده کنید. یادگیری برنامه نویسی می تواند به شما کمک کند تا تفکر منطقی خود را بهبود ببخشید و در زندگی و کار خود تصمیمات بهتری بگیرید.

                    یادگیری سایر مهارت ها: برنامه نویسی می تواند به شما کمک کند تا سایر مهارت ها را نیز یاد بگیرید. به عنوان مثال، یادگیری برنامه نویسی می تواند به شما کمک کند تا مهارت های ریاضی، علوم کامپیوتر و زبان انگلیسی خود را بهبود ببخشید.

                    تاریخچه مختصری از برنامه نویسی
                    تاریخچه برنامه نویسی به دهه 1940 میلادی باز می گردد. در آن زمان، رایانه ها بسیار بزرگ و گران بودند و فقط در دسترس دانشگاه‌ها و شرکت‌های بزرگ بودند. برنامه نویسی علمی بود که تنها در اختیار افراد بسیار محدودی بود و تنها آن‌ها می‌توانستند فرایند آموزش برنامه نویسی را طی کنند.

                    اولین زبان برنامه نویسی سطح بالا
                    اولین زبان برنامه نویسی، Plankalkül  نام داشت که توسط Konrad Zuse در سال های 1942 تا 1945 توسعه یافت. این زبان یک زبان برنامه نویسی سطح بالا بود که از مفهوم تابع استفاده می کرد. Plankalkül هرگز به صورت گسترده‌ای استفاده نشد، اما تأثیر زیادی بر توسعه زبان‌های برنامه نویسی بعدی داشت.

                    ظهور زبان های برنامه نویسی سطح بالا
                    در دهه 1950، زبان های برنامه نویسی سطح بالا شروع به توسعه یافتند. زبان های برنامه نویسی سطح بالا برای انسان ها قابل خواندن تر هستند و استفاده از آنها آسان تر است. برخی از اولین زبان های برنامه نویسی سطح بالا عبارتند از:

                    FORTRAN (1957) : یک زبان برنامه نویسی برای محاسبات علمی

                    COBOL (1959): یک زبان برنامه نویسی برای سیستم های تجاری

                    LISP (1958) : یک زبان برنامه نویسی برای هوش مصنوعی

                    توسعه زبان های برنامه نویسی مدرن
                    در دهه های 1960 و 1970، زبان های برنامه نویسی مدرن شروع به توسعه کردند. این زبان ها از ویژگی های جدیدی مانند کلاس ها، شی گرایی و مجموعه ها استفاده می کردند. برخی از زبان های برنامه نویسی مدرن عبارتند از:

                    C (1972) : یک زبان برنامه نویسی عمومی که برای سیستم عامل ها و برنامه های کاربردی استفاده می‌شود.

                    Java (1995) : یک زبان برنامه نویسی شی گرا که برای توسعه وب و برنامه های کاربردی استفاده می‌شود.

                    Python (1991) : یک زبان برنامه نویسی سطح بالا که برای یادگیری ماشین و هوش مصنوعی استفاده می‌شود.

                    توسعه برنامه نویسی به عنوان یک شغل
                    در دهه های 1980 و 1990، برنامه نویسی به یک شغل محبوب تبدیل شد. با افزایش استفاده از کامپیو‌ترهای شخصی در همه زمینه های زندگی، تقاضا برای برنامه نویسان نیز افزایش یافت.

                    امروزه، برنامه نویسی یکی از پرتقاضاترین مهارت ها در بازار کار است. برنامه نویسان می توانند در طیف گسترده ای از صنایع از جمله فناوری، مالی، پزشکی و دولتی کار کنند.

                    آینده برنامه نویسی
                    با ادامه توسعه فناوری، آینده برنامه نویسی روشن است. برنامه نویسان نقش مهمی در ایجاد محصولات و خدمات جدید و نوآورانه ایفا خواهند کرد.

                    آموزش برنامه نویسی از صفر
                    بسیاری از افراد این سوال را می‌پرسند که برای یادگیری برنامه نویسی نیاز است که از چه نقطه‌ای کار را شروع کنند. این سوالی است که بی نهایت جواب داشته و نمی‌توان به یک پاسخ واحد دست پیدا کرد. اما ما در اینجا قصد داریم شما را به صورت بهتری با این مسیر آشنا کنیم و همچنین یک دوره کاملا مقدماتی و البته رایگان را به شما معرفی کنیم.

                    هر علمی در فرایند یادگیری خود نیاز به یکسری مقدمات دارد. برنامه نویسی نیز از این موضوع مستثنی نیست. برای یادگیری و آموزش برنامه نویسی ابتدا نیاز است که از که با مفاهیم اولیه برنامه نویسی آشنا شده و سپس مسیر یادگیری خود را در بین زبان‌ها و ابزارهای برنامه نویسی مختلف انتخاب کنید.
                </div>
                {!open &&
                    <div className="absolute bottom-0 left-0 right-0 h-full w-full bg-gradient-to-t from-secondary via-secondary/70 to-secondary/0 "></div>
                }
            </div>

            <DivButton className='absolute bg-secondary !w-fit bottom-0 left-1/2 transform -translate-x-1/2 translate-y-1/2 z-20  flex justify-center items-center gap-2 border-2 p-3 rounded-xl'
                onClick={() => {
                    setOpen(!open);
                }}>
                <Icon className="h-7 w-7" name="eye" />
                {open ?
                    <div>بستن مطلب</div>
                    :
                    <div>ادامه مطلب</div>
                }
            </DivButton>


        </div>
    );
};

export default CollapsibleText;